In [50]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

# Исходные данные

In [155]:
data=pd.read_csv('titanic.csv')

In [156]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Оставляю только нужные столбцы и удаляю пустные значения

In [166]:
xData=pd.DataFrame({"Pclass":data['Pclass'],"Fare":data['Fare'],"Age":data['Age'],'Sex':data['Sex'],"Survived":data['Survived']})
xData.head()

    Age     Fare  Pclass     Sex  Survived
0  22.0   7.2500       3    male         0
1  38.0  71.2833       1  female         1
2  26.0   7.9250       3  female         1
3  35.0  53.1000       1  female         1
4  35.0   8.0500       3    male         0

In [169]:
xData=xData.replace(['male','female'],[1,0]) #Заменяю   male to 1    female to 0

In [170]:
xData=xData.dropna(axis=0,how='any')
xData.count()

Age         714
Fare        714
Pclass      714
Sex         714
Survived    714
dtype: int64

# Формирую столбец (уData) с ответами

In [171]:
yData=pd.DataFrame({"Survived":xData['Survived']})

In [172]:
xData.drop("Survived",axis=1,inplace=True)

In [173]:
xData.head()

    Age     Fare  Pclass  Sex
0  22.0   7.2500       3    1
1  38.0  71.2833       1    0
2  26.0   7.9250       3    0
3  35.0  53.1000       1    0
4  35.0   8.0500       3    1

# Создаю модель

In [174]:
clf = DecisionTreeClassifier(random_state=241)

# Тренирую модель

In [175]:
clf.fit(xData,yData)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            presort=False, random_state=241, splitter='best')

#  Создаю матрицу показывающую какие признаки самые главные

In [179]:
importances = clf.feature_importances_

In [180]:
importances

array([ 0.2560461 ,  0.30343647,  0.14000522,  0.30051221])

# Записываю ответ в файл

In [184]:
f=open("1.txt",'w')
f.write("Fare Sex")
f.close()